In [67]:
import pandas as pd

In [68]:
df = pd.read_csv("input.csv", sep="\s+", header=None, names=["first", "second"])
df.head()

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
/var/folders/gg/zy9sr5191bg1yg8gbtj9w1k80000gp/T/ipykernel_42404/199554877.py:1: SyntaxWarning: invalid escape sequence '\s'
  df = pd.read_csv("input.csv", sep="\s+", header=None, names=["first", "second"])

   first  second
0  19394   30201
1  88523   40612
2  60736   82993
3  75224   92188
4  78157   27314

In [69]:
df.shape

(1000, 2)

In [70]:
first = df["first"].sort_values(ascending=True, ignore_index=True)
first.head()

0    10007
1    10525
2    10561
3    10606
4    10623
Name: first, dtype: int64

In [71]:
second = df["second"].sort_values(ascending=True, ignore_index=True)
second.head()

0    10144
1    10146
2    10231
3    10317
4    10605
Name: second, dtype: int64

In [72]:
df = pd.concat([first, second], axis=1)

In [73]:
df.head()

   first  second
0  10007   10144
1  10525   10146
2  10561   10231
3  10606   10317
4  10623   10605

In [74]:
df["diff"] = abs(df["first"] - df["second"])
df.head()

   first  second  diff
0  10007   10144   137
1  10525   10146   379
2  10561   10231   330
3  10606   10317   289
4  10623   10605    18

In [75]:
df["diff"].sum()

2742123